app/views/users/_form.html.erb

    <td> <%= form.label 'Ville' %> </td>
    <td> <%= form.select :city_id, City.all.map {|c| [c.name, c.id]} %> </td>
---
SELECT "cities".* FROM "cities" ORDER BY "cities"."name" ASC