app/controllers/gossips_controller.rb

  def home
    @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"

  def create
    @gossip = Gossip.new(gossips_params)
    city = City.new
    user = User.new
    user.city = city
    @gossip.user = user
    if @gossip.save
---
INSERT INTO "gossips" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["content", "erterte\r\n"], ["created_at", "2020-08-06 22:14:44.795112"], ["updated_at", "2020-08-06 22:14:44.795112"]]

  def index
   @gossips = Gossip.all
---
SELECT "gossips".* FROM "gossips"