app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "monica.richaume@gmail.com"], ["LIMIT", 1]]
---
  def create
    # cherche un utilisateur existant
    user = User.find_by(email: params[:email])