app/controllers/users_controller.rb

  def new
    @user = User.new
    @city = City.all.order(:name)
---
SELECT "cities".* FROM "cities" ORDER BY "cities"."name" ASC

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"